{
  "url": "https://kasparchive.com",
  "scraped_at": "2025-08-11T06:19:44.023873Z",
  "page_title": "KaspArchive - Your Guide to Kaspa Facts",
  "sections": [
    {
      "label": "FUD 1",
      "heading": "FUD 1: \"Kaspa was unfairly launched and is secretly controlled by DAGLabs\"",
      "false_claim": "Kaspa's launch was rigged, and it remains under the hidden control of DAGLabs, who enriched themselves with a pre-mine.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "DAGLabs, founded in 2018 by Yonatan Sompolinsky, was initially funded to research and develop the GhostDAG protocol and explore optical ASIC mining for a cryptocurrency. Investment totaled $8M, primarily from Polychain."
        },
        {
          "label": "Fact 2",
          "text": "By mid-2021, recognizing the limitations of optical ASIC technology and shifting crypto market sentiment away from PoW, DAGLabs and Polychain made a deliberate decision to transition Kaspa into a community-owned, open-source project, explicitly relinquishing any intellectual property rights. This directly contradicts the notion of continued secret control."
        },
        {
          "label": "Fact 3",
          "text": "At the mainnet launch in November 2021, DAGLabs was in a transitional phase, providing minimal support to developers during the network's initial phase."
        },
        {
          "label": "Fact 4",
          "text": "Post-launch, DAGLabs mined Kaspa openly and transparently, using publicly available rented cloud hardware (Amazon initially, then GPUs). This mining was funded by the remaining portion of their initial investment, demonstrating no secret or privileged mining operation."
        },
        {
          "label": "Fact 5",
          "text": "DAGLabs' mining activity lasted only about five months, ceasing entirely when their limited remaining funds were depleted."
        },
        {
          "label": "Fact 6",
          "text": "The total amount of Kaspa mined by DAGLabs was less than 3% of the total supply (estimated at 2.5%, under 850M Kas). This modest amount invalidates the claim of a massive pre-mine for enrichment."
        },
        {
          "label": "Fact 7",
          "text": "The mined coins were distributed proportionally to investors and former DAGLabs contributors as part of their wind-down process, a transparent distribution, not hidden accumulation."
        },
        {
          "label": "Fact 8",
          "text": "DAGLabs officially ceased operations and dissolved after this period, definitively ending any operational control or involvement with Kaspa. DAGLabs does not control Kaspa."
        },
        {
          "label": "Fact 9",
          "text": "Kaspa's history demonstrates a clear and documented transition to a community-driven project, directly refuting the myth of unfair launch and ongoing DAGLabs control."
        }
      ],
      "references": [
        "https://wiki.kaspa.org/en/prehistory",
        "https://x.com/DesheShai/status/1680899017708912640?t=JZWXtwwc3yVkdCdY69rTBQ&s=19"
      ]
    },
    {
      "label": "FUD 2",
      "heading": "FUD 2: \"PoS > PoW?\"",
      "false_claim": "Many argue that PoS is more secure, more efficient, and less wasteful than PoW. However, PoS introduces economic centralization risks, validator cartels, and weak security guarantees. Kaspa's PoW model ensures true decentralization and resilience against long-range attacks, which PoS cannot achieve.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "The supposed 'superiority' of PoS is not a universally accepted fact but a heavily debated topic, deeply influenced by complex and unpredictable economic factors, not just theoretical mathematical models. There is no definitive proof of PoS superiority."
        },
        {
          "label": "Fact 2",
          "text": "Claims that 'PoS is factually better' lack objective, universally agreed-upon evidence and often ignore critical security and decentralization trade-offs. These claims are not based on settled science."
        },
        {
          "label": "Fact 3",
          "text": "PoW and PoS represent fundamentally different approaches with distinct security, decentralization, and economic characteristics. The 'best' choice is context-dependent and not universally determined. To declare one definitively superior is inaccurate and ignores crucial nuances."
        },
        {
          "label": "Fact 4",
          "text": "Research advancements like \"Mining in Logarithmic Space\" and NiPoPoW demonstrate that Proof-of-Work protocols can achieve near-logarithmic storage requirements through secure pruning of consensus data. In contrast, Proof-of-Stake protocols, lacking a mining mechanism, are limited to linear storage growth, making them significantly less scalable and more storage intensive over time."
        },
        {
          "label": "Fact 5",
          "text": "Focusing solely on the operational costs of PoW and ignoring its security benefits presents a distorted economic comparison. PoW's costs are investments in robust, decentralized security."
        },
        {
          "label": "Fact 6",
          "text": "Both PoW and PoS require economic incentives to secure the network. PoW uses mining rewards and fees, while PoS uses staking rewards and minting. The economic mechanisms are comparable in function, not inherently superior or inferior in design. To claim PoS is economically 'superior' solely due to lower operational costs is superficial and ignores the value of PoW security."
        },
        {
          "label": "Fact 7",
          "text": "Comparing attack costs based only on token acquisition price for PoS versus hardware costs for PoW is a grossly oversimplified and often misleading way to evaluate network security. Real-world attack costs are far more complex."
        },
        {
          "label": "Fact 8",
          "text": "The actual cost of a successful attack on both PoW and PoS networks is dynamic and significantly influenced by market conditions, token liquidity, and the specific type of attack considered. There is no simple, static 'cost' to compare."
        },
        {
          "label": "Fact 9",
          "text": "Security vulnerabilities and attack vectors are fundamentally different between PoW and PoS. PoS may be more susceptible to censorship attacks with lower stake control, while PoW requires massive resource domination for sustained censorship. They have different security profiles, not simply different 'costs'."
        },
        {
          "label": "Fact 10",
          "text": "Long-term centralization risks differ. PoS can exhibit 'rich-get-richer' dynamics, potentially concentrating stake and influence. PoW faces ongoing operational and technological challenges to maintain dominance, creating different, but not necessarily weaker, security dynamics. Neither is inherently immune to centralization risks. To claim PoS is always more secure based on a simplistic cost comparison is factually inaccurate."
        }
      ],
      "references": [
        "https://kasmedia.com/article/understanding-ghostdag-intro",
        "https://medium.com/@danhedl/pow-is-efficient-aa3d442754d3",
        "https://x.com/DesheShai/status/1883191027869065654",
        "https://eprint.iacr.org/2021/623.pdf"
      ]
    },
    {
      "label": "FUD 3",
      "heading": "FUD 3: \"Kaspa's Scalability is Limited by Ledger Growth & L2 Flaws\"",
      "false_claim": "Critics claim Kaspa will struggle with state bloat due to its high-speed transactions.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "That's wrong! Kaspa developers have created a smart solution called KIP-9 specifically to prevent the ledger from getting too big and to make sure Kaspa can keep scaling up for many, many users."
        },
        {
          "label": "Fact 2",
          "text": "KIP-9 adds a \"storage cost\" to transactions. Think of it like a small fee for using storage space on the Kaspa network. Transactions that take up more space (like creating lots of tiny coin pieces) pay a bit more, which stops the ledger from ballooning."
        },
        {
          "label": "Fact 3",
          "text": "This \"storage cost\" system is designed to automatically control ledger size. The cost to make the ledger bigger increases very quickly, making it too expensive for anyone to try and overload the system and cause problems. Kaspa is designed to stay efficient as it grows."
        },
        {
          "label": "Fact 4",
          "text": "KIP-9 is not just an idea – it's already part of Kaspa's software and is actively working behind the scenes to keep the ledger size in check. This is a real, working solution for long-term growth."
        },
        {
          "label": "Fact 5",
          "text": "Experts have tested KIP-9 and confirmed it works. They've shown that it stops ledger bloat attacks and keeps the ledger growth manageable, even if Kaspa becomes incredibly popular. Kaspa is designed to scale, and KIP-9 is a key reason why."
        },
        {
          "label": "Fact 6",
          "text": "Kaspa's L2 strategy is built upon 'based rollups,' a cutting-edge L2 design that directly addresses the shortcomings of earlier L2 architectures and offers a highly secure and scalable solution. Kaspa is using advanced L2 technology."
        },
        {
          "label": "Fact 7",
          "text": "Based rollups on Kaspa inherit the uncompromising security and censorship resistance of the Kaspa L1, as L1 sequencing is deeply integrated into their design. Kaspa L2s are fundamentally secure."
        },
        {
          "label": "Fact 8",
          "text": "Based rollups on Kaspa are designed to enhance user experience, streamline interoperability between different L2s within the Kaspa ecosystem, and ensure that L2 activity contributes to the economic robustness of the Kaspa L1. Kaspa L2s are designed for usability and economic alignment."
        },
        {
          "label": "Fact 9",
          "text": "Kaspa's entire architecture is being meticulously engineered from the ground up to seamlessly support efficient and secure L2 solutions, recognizing L2s as an essential component of truly scalable smart contract platforms. L2 scaling is a core design principle of Kaspa. To dismiss L2 scaling for Kaspa is to ignore its fundamental architectural approach."
        }
      ],
      "references": [
        "https://x.com/DesheShai/status/1773663596607652043?t=e8qJxhSySH9d1cF5vikXUA&s=19",
        "https://x.com/DesheShai/status/1797666923469037944",
        "https://x.com/DesheShai/status/1883191027869065654?t=u7MUoJdpISqZ0vwCG4Xv1A&s=19",
        "https://github.com/kaspanet/kips/blob/master/kip-0009.md",
        "https://eprint.iacr.org/2021/623.pdf",
        "https://x.com/coinathlete/status/1858091797710319622?t=wLv0DwDpfilQs6O_OpkkXw&s=09"
      ]
    },
    {
      "label": "FUD 4",
      "heading": "FUD 4: \"Gaps in Kaspa's ledger history imply security or transparency issues\"",
      "false_claim": "Missing ledger history data means the current state of Kaspa cannot be verified from genesis, potentially hiding a pre-mine or other malicious activities, thus compromising security and transparency.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "Ledger pruning is essential for Kaspa's long-term decentralization and sustainability. At full capacity (10 BPS), the ledger grows by approximately 30TB per year, making archival nodes impractical for widespread decentralization without pruning."
        },
        {
          "label": "Fact 2",
          "text": "The genesis block is hardcoded directly into the Kaspa node software. This hardcoded genesis block contains an empty UTXO set, verifiably demonstrating that there was no pre-mine."
        },
        {
          "label": "Fact 3",
          "text": "Kaspa nodes store a \"proof-of-genesis.\" This cryptographic proof verifies that the current state of the ledger is derived from the hardcoded genesis block, without requiring the entire historical ledger data."
        },
        {
          "label": "Fact 4",
          "text": "Forging the proof-of-genesis would require computational work equivalent to creating the entire ledger history, ensuring its security and authenticity."
        },
        {
          "label": "Fact 5",
          "text": "The data available to each Kaspa node, including the proof-of-genesis, is sufficient to verify the current state back to genesis, ensuring transparency and security even without a complete historical ledger."
        },
        {
          "label": "Fact 6",
          "text": "Kaspa employs techniques to provide proof of chain integrity without the entire ledger history. For example, a chain of checkpoint blocks (growing by one header per day) can be verified all the way back to genesis."
        },
        {
          "label": "Fact 7",
          "text": "These checkpoint blocks, combined with UTXO commitments, cryptographically prove that the current state evolved from a genesis block with an empty UTXO set, thus demonstrating no pre-mine."
        },
        {
          "label": "Fact 8",
          "text": "The MLS protocol, relevant to Kaspa, uses a special type of Non-Interactive Proofs of Proof-of-Work (NiPoPoW) to succinctly prove chain weight, which inherently prohibits pre-mining attacks."
        },
        {
          "label": "Fact 9",
          "text": "The lack of archival nodes from the beginning was a matter of prioritization post-launch, not a security risk, as it was understood that ledger gaps do not compromise network integrity."
        },
        {
          "label": "Fact 10",
          "text": "This approach provides a security level comparable to Nakamoto Consensus, offering a robust chain integrity proof that is more practical than requiring a full \"proof-of-history\" (which is considered unreasonably stringent for scalability)."
        }
      ],
      "references": [
        "https://hashdag.medium.com/kaspa-black-tuesday-8c7f4fa35834",
        "https://x.com/DesheShai/status/1808177677674684772",
        "https://github.com/kaspagang/kaspad-py-explorer/blob/main/src/genesis_proof.ipynb",
        "https://discord.com/channels/599153230659846165/844142778232864809/912831900287131649"
      ]
    },
    {
      "label": "FUD 5",
      "heading": "FUD 5: \"PoW is Unsustainable, Centralized, and Inaccessible\"",
      "false_claim": "Some claim PoW mining is too expensive for average users, harms the environment, and leads to mining centralization. However, PoW enables fair participation, prevents validator cartels (unlike PoS), and can use renewable energy sources. Mining pools exist, but individual miners can still participate without giving up control.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "PoW mining is actually more decentralized than many think! Anyone can start mining with basic hardware, and there are miners all around the world. This global spread helps keep the network secure and fair."
        },
        {
          "label": "Fact 2",
          "text": "Mining costs vary a lot depending on where you are. In many places, especially where there's extra electricity that would go to waste, mining can be very profitable even for smaller miners."
        },
        {
          "label": "Fact 3",
          "text": "The idea that only big companies can mine successfully isn't true. Many individual miners do well by finding good locations and keeping their costs low. It's all about being smart with your setup."
        },
        {
          "label": "Fact 4",
          "text": "PoW mining predominantly uses excess, stranded, or renewable energy that would otherwise be wasted. It can actually incentivize and fund renewable energy development."
        },
        {
          "label": "Fact 5",
          "text": "Mining operations are highly mobile and can be strategically located where energy is abundant and cheap, often utilizing energy that would otherwise be wasted."
        },
        {
          "label": "Fact 6",
          "text": "The environmental impact must be weighed against the critical service PoW provides: securing a decentralized, permissionless monetary network. This security mechanism is essential for a truly independent financial system."
        },
        {
          "label": "Fact 7",
          "text": "Mining pools are voluntary associations that miners can freely join or leave. This dynamic nature prevents any single pool from gaining too much control."
        },
        {
          "label": "Fact 8",
          "text": "Kaspa's high blockrate and GHOSTDAG protocol naturally discourage pool centralization by reducing variance in mining rewards, making solo mining more viable."
        },
        {
          "label": "Fact 9",
          "text": "The ability to easily switch between pools or mine independently creates market pressure that keeps pools competitive and honest."
        }
      ],
      "references": [
        "https://medium.com/@danhedl/pow-is-efficient-aa3d442754d3",
        "https://medium.com/@danhedl/pow-is-efficient-aa3d442754d3",
        "https://x.com/DesheShai/status/1883191027869065654",
        "https://x.com/coinathlete/status/1639989498384732160?t=P5lsgxgUo5yz7JJ5k9ht2w&s=19"
      ]
    },
    {
      "label": "FUD 6",
      "heading": "FUD 6: \"Kaspa's Speed & PoW Costs Make It Inefficient\"",
      "false_claim": "Some argue Kaspa's 10-second finality is too slow and that PoW costs are wasteful. However, Kaspa's GhostDAG ensures rapid block propagation, enabling parallel transaction processing. Additionally, PoW cost secures the network, making it more robust against attacks compared to cost-efficient but weaker security models like PoS.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "Kaspa's GhostDAG protocol is a breakthrough that allows for parallel processing of transactions, making it much faster than traditional blockchains."
        },
        {
          "label": "Fact 2",
          "text": "The 10-second finality is actually incredibly fast compared to most other cryptocurrencies, which can take minutes or even hours for true finality."
        },
        {
          "label": "Fact 3",
          "text": "Kaspa's design allows it to handle many more transactions per second than older blockchain designs, making it highly efficient."
        },
        {
          "label": "Fact 4",
          "text": "The energy used in mining Kaspa isn't wasted – it's what makes the network secure and trustworthy."
        },
        {
          "label": "Fact 5",
          "text": "Kaspa's mining efficiency comes from its ability to process multiple blocks simultaneously, maximizing the utility of the energy spent on mining."
        },
        {
          "label": "Fact 6",
          "text": "The energy expenditure in PoW directly contributes to network security by making attacks economically unfeasible. This is not waste, but rather a crucial feature that enables trustless consensus."
        },
        {
          "label": "Fact 7",
          "text": "PoW's energy cost creates a real-world anchor for digital scarcity, something that cannot be achieved through purely digital means. The physical cost of mining gives fundamental value to the network."
        },
        {
          "label": "Fact 8",
          "text": "The competitive nature of PoW mining drives innovation in energy efficiency and utilization of otherwise wasted energy sources, contributing to broader technological advancement."
        }
      ],
      "references": [
        "https://medium.com/@danhedl/pow-is-efficient-aa3d442754d3",
        "https://x.com/DesheShai/status/1883191027869065654"
      ]
    },
    {
      "label": "FUD 7",
      "heading": "FUD 7: \"Kaspa Lacks Utility Because It Has No Smart Contracts or DeFi\"",
      "false_claim": "Some believe that without smart contracts and DeFi, Kaspa has no future. However, Kaspa was designed as a scalable and secure PoW Layer 1, and Layer 2 solutions will enable smart contract functionality in the future. Its instant confirmations and efficient transactions already offer strong utility for payments and settlement layers.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "Kaspa's focus on building a robust, scalable Layer 1 is intentional and strategic. This approach ensures a solid foundation for future developments."
        },
        {
          "label": "Fact 2",
          "text": "The absence of smart contracts today doesn't mean they won't be added. Kaspa's roadmap includes plans for smart contract functionality through Layer 2 solutions."
        },
        {
          "label": "Fact 3",
          "text": "Many successful cryptocurrencies started without smart contracts and added them later. This approach allows for careful testing and implementation."
        },
        {
          "label": "Fact 4",
          "text": "Kaspa's instant transaction finality already provides significant utility for fast, secure payments – a fundamental use case for cryptocurrency."
        },
        {
          "label": "Fact 5",
          "text": "While DeFi is undeniably important, Kaspa's utility extends far beyond just DeFi. Its exceptional transaction speed and throughput make it ideal for a wide range of applications, including microtransactions, high-volume data processing, and more. Kaspa's utility is not limited to DeFi."
        },
        {
          "label": "Fact 6",
          "text": "The planned integration of smart contracts is specifically intended to enable a vibrant DeFi ecosystem on Kaspa, recognizing DeFi as a crucial component of a comprehensive crypto platform. DeFi is part of Kaspa's future."
        },
        {
          "label": "Fact 7",
          "text": "Kaspa's deliberate focus on foundational scaling and infrastructure improvements is building a stronger and more resilient foundation for a future DeFi ecosystem that can leverage its unique technical advantages. Kaspa is building a superior DeFi platform, not ignoring DeFi."
        }
      ],
      "references": [
        "https://medium.com/@kaspanet/kaspa-roadmap-2024-25-d9ce5f0aa19c",
        "https://x.com/DesheShai/status/1883191027869065654"
      ]
    },
    {
      "label": "FUD 8",
      "heading": "FUD 8: \"Kaspa is just another scalable PoW L1, lacking genuine innovation\"",
      "false_claim": "Kaspa offers nothing truly new or groundbreaking, simply repackaging existing ideas.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "Kaspa represents a major leap forward in blockchain technology, achieving an unprecedented combination of scalability, speed, and security within a Proof-of-Work framework. Kaspa is demonstrably innovative."
        },
        {
          "label": "Fact 2",
          "text": "Kaspa incorporates groundbreaking innovations like the GHOSTDAG protocol, BlockDAG architecture, and planned advancements for MEV resistance and secure oracles. These are not just incremental changes, but fundamental advancements."
        },
        {
          "label": "Fact 3",
          "text": "Kaspa directly tackles and solves critical limitations of existing blockchains, such as state bloat and slow transaction finality, with novel and sophisticated technical solutions. Kaspa is pushing the boundaries of blockchain technology. To claim it lacks innovation is to ignore the substantial technical breakthroughs it represents."
        }
      ],
      "references": [
        "https://youtu.be/MugsziO0OYY?si=P5X4ULsQbEEI3Fsj"
      ]
    },
    {
      "label": "FUD 9",
      "heading": "FUD 9: \"Kaspa is not quantum-secure and will be obsolete when quantum computers arrive\"",
      "false_claim": "Blockchains that rely on elliptic curve (EC) cryptography will be broken once quantum computers become powerful enough. Without immediate adoption of post-quantum cryptography (PQC), these networks are ignoring the threat and will eventually become obsolete.",
      "facts": [
        {
          "label": "Fact 1",
          "text": "Quantum computers capable of breaking EC cryptography are still far from being practical. While advancements are being made, large-scale quantum machines with millions of stable qubits—needed to break EC encryption—do not yet exist. Even optimistic projections suggest this is decades away."
        },
        {
          "label": "Fact 2",
          "text": "The Boneh-Lipton attack on EC cryptography is a well-known theoretical threat, but mitigations exist. Increasing key sizes or shifting to larger elliptic curves can provide additional security for years before a full transition to PQC is necessary."
        },
        {
          "label": "Fact 3",
          "text": "Post-quantum cryptography (PQC) is not yet ready for large-scale blockchain adoption. Many PQC schemes have significant trade-offs, including larger key and signature sizes that increase data storage and transaction costs, higher computational requirements that slow down transaction processing, and limited real-world testing compared to the decades of security validation that EC cryptography has undergone."
        },
        {
          "label": "Fact 4",
          "text": "Kaspa's blockDAG architecture makes it better suited for a future transition to PQC compared to traditional blockchain designs. Since blockDAG technology enables high throughput and efficient transaction processing, it can better accommodate the larger signature sizes required by post-quantum cryptography. While many blockchains struggle with scalability limitations, Kaspa's ability to handle high transaction volumes without bottlenecks allows for a smoother adoption of quantum-safe cryptographic solutions when the technology is mature."
        },
        {
          "label": "Fact 5",
          "text": "Quantum mining, not just cryptographic breaking, presents a unique challenge. Unlike classical mining, quantum miners could attempt strategies that increase orphan rates and disrupt network stability. Protocols designed to manage high orphan rates and network adaptability may have an advantage if quantum mining ever becomes viable."
        },
        {
          "label": "Fact 6",
          "text": "The timeline for quantum threats is long, allowing gradual transitions. Even if quantum advancements accelerate, blockchain protocols can adopt quantum-safe cryptographic methods when they are sufficiently tested and optimized, rather than rushing into unproven solutions."
        }
      ],
      "references": [
        "https://x.com/DesheShai/status/1681696299358343169?t=2RH2OE-cc3RZjcixfWkgMA&s=19",
        "https://t.co/J3RaAGxcG6",
        "https://eprint.iacr.org/2021/772",
        "https://eprint.iacr.org/2023/362",
        "https://arxiv.org/abs/1804.08118"
      ]
    }
  ]
}